grails-app/views/templates/input_xml/_hoi_tin_sp_codinh.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:cic="http://www.endpoint.ws.h2h.cic.org.vn/cicqa">
    <soapenv:Header/>
    <soapenv:Body>
        <cic:HoiTin>
            <cic:TTChung>
                <cic:LoaiSP>{LoaiSP}</cic:LoaiSP>
                <cic:SLPhieu>{SLPhieu}</cic:SLPhieu>
            </cic:TTChung>
            <cic:DSKhachHang>
                <!--Zero or more repetitions:-->
                <cic:Dong>
                    <cic:MaSoPhieu>{MaSoPhieu}</cic:MaSoPhieu>
                    <cic:TenKH>{TenKH}</cic:TenKH>
                    <cic:MaKH>{MaKH}</cic:MaKH>
                    <cic:MaCIC>{MaCIC}</cic:MaCIC>
                    <cic:DiaChi>{DiaChi}</cic:DiaChi>
                    <cic:MSThue>{MSThue}</cic:MSThue>
                    <cic:SoCMT>{SoCMT}</cic:SoCMT>
                    <cic:DKKD>{DKKD}</cic:DKKD>
                    <cic:LoaiGTK>{LoaiGTK}</cic:LoaiGTK>
                    <cic:SoGTK>{SoGTK}</cic:SoGTK>
                    <cic:GhiChu>{GhiChu}</cic:GhiChu>
                </cic:Dong>
                <cic:Dong>
                    <cic:MaSoPhieu>{MaSoPhieu}</cic:MaSoPhieu>
                    <cic:TenKH>{TenKH}</cic:TenKH>
                    <cic:MaKH>{MaKH}</cic:MaKH>
                    <cic:MaCIC>{MaCIC}</cic:MaCIC>
                    <cic:DiaChi>{DiaChi}</cic:DiaChi>
                    <cic:MSThue>{MSThue}</cic:MSThue>
                    <cic:SoCMT>{SoCMT}</cic:SoCMT>
                    <cic:DKKD>{DKKD}</cic:DKKD>
                    <cic:LoaiGTK>{LoaiGTK}</cic:LoaiGTK>
                    <cic:SoGTK>{SoGTK}</cic:SoGTK>
                    <cic:GhiChu>{GhiChu}</cic:GhiChu>
                </cic:Dong>
            </cic:DSKhachHang>
        </cic:HoiTin>
    </soapenv:Body>
</soapenv:Envelope>
